/*
 * =====================================================================================
 *
 *       Filename:  c89_keyword.h
 *
 *    Description:  
 *
 *        Version:  1.0
 *        Created:  09/30/2021 06:29:46 AM
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  YOUR NAME (), 
 *   Organization:  
 *
 * =====================================================================================
 */
#ifndef _C89_KEYWORD_H_
#define _C89_KEYWORD_H_

/************************************  
 * 以下是c89 关键字说明
 ***********************************/

/***********************************
 * 数据类型关键字
 * 1. char                          声明字符型变量或者函数
 * 2. double                        声明双精度变量或者函数
 * 3. enum                          声明枚举变量
 * 4. float                         声明浮点型变量或者函数
 * 5. int                           声明整型变量或者函数
 * 6. long                          声明长整型变量或者函数
 * 7. short                         声明短整型变量或者函数
 * 8. signed                        声明有符号变量或者函数
 * 9. struct                        声明结构体变量或者函数
 * 10. union                        声明联合体数据类型
 * 11. unsigned                     声明无符号类型变量或者函数
 * 12. void                         声明函数无返回值或者无参数，声明五类型指针
 * 控制语句关键字
 *  循环语句
 * 13. for
 * 14. do
 * 15. while
 * 16. break
 * 17. continue
 *  条件语句
 * 18. if
 * 19. else
 * 20. goto
 *  开关语句
 * 21. switch
 * 22. case
 * 23. default
 *  返回语句
 * 24. return
 * 存储类型关键字 在修饰变量的时候不能同时使用一个以上的存储类关键字
 * 25. auto                          声明自动变量一般不使用 
 * 26. extern
 * 27. register                     建议编译器将相应变量存放在寄存器中
 * 28. static                       声明静态变量
 * 29. typedef
 * 其他关键字
 * 30. const                         声明只读变量
 * 31. sizeof
 * 32. volatile                     提醒编译器它后面所定义的变量随时都有可能改变
 **********************************/

#endif //_C89_KEYWORD_H_ end

